/*************************************************************************题目(P1099) :
编写程序，循环输入一对浮点数，打印两数之差除以两数之和的结果(一行一个结果)。
输入两个数均为0时，程序停止。

样例输入
1 4
0 0
样例输出
-0.600000
************************************************************************/


#define _CRT_SECURE_NO_WARNINGS 1
#include <iostream>
using namespace std;

int main1099()
{
	double d1 = 0, d2 = 0;
	//逗号表达式，在逗号表达式中，返回表达式后者
	while (cin>>d1>>d2,!(d1 == 0 && d2 == 0))//d1,d2都不等于0，即返回1执行死循环，返回0不执行
	{
		printf("%.6lf", (d1 - d2) / (d1 + d2));
		//cout << (d1 - d2) / (d1 + d2) << endl;
	}
	
	return 0;
}